### Terraform Plan — `dev` 📋

<details>
<summary>Click to expand plan output</summary>

```hcl
time=2026-03-17T04:03:51Z level=info msg=The stack at /home/runner/work/devops-infra-live/devops-infra-live/environments/dev will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/dynamodb
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/eventbridge
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/s3
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc

Group 2
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet

Group 3
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds

Group 4
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table


time=2026-03-17T04:03:51Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc] 
time=2026-03-17T04:03:51Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/eventbridge/.terragrunt-cache/MdcOvC9mbd0-zozvtHjRtXGnQ64/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/eventbridge] 
time=2026-03-17T04:03:51Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs] 
time=2026-03-17T04:03:51Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs] 
time=2026-03-17T04:03:51Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/dynamodb/.terragrunt-cache/j5exsj6NnfORRmFvgA4ZFTJl4Es/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/dynamodb] 
time=2026-03-17T04:03:51Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns] 
time=2026-03-17T04:03:51Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront] 
time=2026-03-17T04:03:51Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/s3/.terragrunt-cache/Di5wular24ljuRwSQeQGhJt_0XY/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/s3] 
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
- Installing hashicorp/aws v5.100.0...
Initializing the backend...
time=2026-03-17T04:03:54Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo/sns] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns] 

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
time=2026-03-17T04:03:55Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo/cloudfront] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront] 

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
time=2026-03-17T04:03:57Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo/sqs] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs] 

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
time=2026-03-17T04:03:58Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo/ecs] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs] 
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
aws_vpc.this["spoke-vpc"]: Refreshing state... [id=vpc-02044a418a9bf87c7]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.this["aditya-unique-s3"] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "aditya-unique-s3"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "ManagedBy" = "terraform"
          + "Name"      = "aditya-unique-s3"
          + "Project"   = "my-infra"
        }
      + tags_all                    = {
          + "ManagedBy" = "terraform"
          + "Name"      = "aditya-unique-s3"
          + "Project"   = "my-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_public_access_block.this["aditya-unique-s3"] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.this["aditya-unique-s3"] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "aws:kms"
                # (1 unchanged attribute hidden)
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ bucket_arns         = {
      + aditya-unique-s3 = (known after apply)
    }
  ~ bucket_domain_names = {
      + aditya-unique-s3 = (known after apply)
    }
  ~ bucket_ids          = {
      + aditya-unique-s3 = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2026-03-17T04:04:07Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group/.terragrunt-cache/weEwUy_RnL4mGvY5_VLvT2ISOOE/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group] 
time=2026-03-17T04:04:07Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway/.terragrunt-cache/_trL-EihvDfxyyWeEbqnbUArHyA/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway] 
time=2026-03-17T04:04:07Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53/.terragrunt-cache/0SZjPEBwXsWiGLqBRnwrz1cup2s/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53] 
time=2026-03-17T04:04:07Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet] 
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
aws_security_group.this["spoke-vpc-default-sg"]: Refreshing state... [id=sg-09c50edd742fc2621]
aws_security_group_rule.cidr_ingress["spoke-vpc-default-sg-cidr-0"]: Refreshing state... [id=sgrule-3006566292]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
aws_internet_gateway.this["spoke-vpc-igw"]: Refreshing state... [id=igw-06f670754feefc807]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
aws_subnet.this["subnet1-public"]: Refreshing state... [id=subnet-0cce988d251ee8a2f]
aws_subnet.this["private-subnet"]: Refreshing state... [id=subnet-0e4ece263184ea1cd]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2026-03-17T04:04:24Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway/.terragrunt-cache/5azPPhrrDgXmVPxUUxPMoi6JtUs/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway] 
time=2026-03-17T04:04:24Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache/.terragrunt-cache/7hMPOHZunzLtNwk6Le2gZ-3Ep2I/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache] 
time=2026-03-17T04:04:24Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2/.terragrunt-cache/2iGhR-uIszg8o4aGvhYOfxMby10/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2] 
time=2026-03-17T04:04:24Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda/.terragrunt-cache/OgS1AJKGed2oPhljv4TlGoiH4NI/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda] 
time=2026-03-17T04:04:24Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds/.terragrunt-cache/mkZZzXex_zfBN9kM0ICfMSSi2LI/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds] 
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
time=2026-03-17T04:04:26Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache/.terragrunt-cache/7hMPOHZunzLtNwk6Le2gZ-3Ep2I/KD9Uz34UoKkZiNL9nShh8OWWCNo/elasticache] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache] 

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
Initializing provider plugins...
- Finding latest version of hashicorp/archive...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/archive v2.7.1...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing the backend...
- Installed hashicorp/archive v2.7.1 (signed by HashiCorp)
- Installing hashicorp/aws v5.100.0...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
- Installing hashicorp/aws v5.100.0...
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
aws_eip.this["spoke-vpc-nat-gw"]: Refreshing state... [id=eipalloc-0efee61434f5fb7fe]
aws_nat_gateway.this["spoke-vpc-nat-gw"]: Refreshing state... [id=nat-0d6e1c1c49428e5e9]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2026-03-17T04:04:39Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table/.terragrunt-cache/lIRIhN32SWXZz9DLJ_LL3FAZI9o/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table] 

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
time=2026-03-17T04:04:40Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb/.terragrunt-cache/erARF1cs8Vay4V6XFlyZ29Y-uzA/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb] 
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route.this["private-subnet-rt-0"] will be created
  + resource "aws_route" "this" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = "nat-0d6e1c1c49428e5e9"
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.this["spoke-vpc-public-rt-0"] will be created
  + resource "aws_route" "this" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = "igw-06f670754feefc807"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.this["private-subnet-rt"] will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "ManagedBy" = "terraform"
          + "Name"      = "private-subnet-rt"
          + "Project"   = "my-infra"
        }
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Name"      = "private-subnet-rt"
          + "Project"   = "my-infra"
        }
      + vpc_id           = "vpc-02044a418a9bf87c7"
    }

  # aws_route_table.this["spoke-vpc-public-rt"] will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "ManagedBy" = "terraform"
          + "Name"      = "spoke-vpc-public-rt"
          + "Project"   = "my-infra"
        }
      + tags_all         = {
          + "ManagedBy" = "terraform"
          + "Name"      = "spoke-vpc-public-rt"
          + "Project"   = "my-infra"
        }
      + vpc_id           = "vpc-02044a418a9bf87c7"
    }

  # aws_route_table_association.this["private-subnet-rt-private-subnet"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0e4ece263184ea1cd"
    }

  # aws_route_table_association.this["spoke-vpc-public-rt-subnet1-public"] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0cce988d251ee8a2f"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + route_table_ids = {
      + private-subnet-rt   = (known after apply)
      + spoke-vpc-public-rt = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2026-03-17T04:04:50Z level=info msg=
Error: Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.


Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.

Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.
time=2026-03-17T04:03:55Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo/cloudfront prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront] 

time=2026-03-17T04:04:50Z level=info msg=
Error: Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.


Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.

Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.
time=2026-03-17T04:03:58Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo/ecs prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs] 

time=2026-03-17T04:04:50Z level=info msg=
Error: Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.


Error: Invalid character

  on variables.tf line 2, in variable "subnet_ids":
   2: variable "subnet_ids" { type = map(string); default = {} }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.

Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "subnet_ids":
   2: variable "subnet_ids" { type = map(string); default = {} }

A single-line block definition must end with a closing brace immediately
after its single argument definition.
time=2026-03-17T04:04:26Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache/.terragrunt-cache/7hMPOHZunzLtNwk6Le2gZ-3Ep2I/KD9Uz34UoKkZiNL9nShh8OWWCNo/elasticache prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache] 

time=2026-03-17T04:04:50Z level=info msg=
Error: Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.


Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.

Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.
time=2026-03-17T04:03:54Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo/sns prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns] 

time=2026-03-17T04:04:50Z level=info msg=
Error: Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.


Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.

Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.
time=2026-03-17T04:03:57Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo/sqs prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs] 

time=2026-03-17T04:04:50Z level=error msg=5 errors occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo/sns] exit status 1
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo/cloudfront] exit status 1
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache/.terragrunt-cache/7hMPOHZunzLtNwk6Le2gZ-3Ep2I/KD9Uz34UoKkZiNL9nShh8OWWCNo/elasticache] exit status 1
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo/sqs] exit status 1
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo/ecs] exit status 1



```

</details>

*Merge this PR to apply changes for project `dev`.*